{
  "id": "3",
  "title": "3 - Programa \"Hola Mundo\" en PHP",
  "contenido": "<div>\n<h2>3 - Programa \"Hola Mundo\" en PHP</h2>\n<p>En este curso suponemos que conoce los elementos principales de HTML y algún lenguaje de programación, por lo menos un poquito (puedes iniciar los conceptos básicos de programación en <a href=\"https://www.tutorialesprogramacionya.com/javaya\" target=\"_blank\">JavaYa</a>)</p>\n<p>Para agregar un programa PHP dentro de una página HTML debemos por un lado al crear el archivo definirlo con extensión php (a diferencia de las páginas estáticas que tienen extensión htm o html)  y dentro del contenido de la página, encerrar el programa entre los símbolos</p>\n<pre> \n  &lt;?php [aquí el programa PHP] ?&gt;\n</pre>\n<p>El comando de PHP para imprimir dentro de la página se llama echo. Nuestro  programa \"Hola Mundo\" será entonces: </p>\n<p class=\"titulopagina\">pagina1.php</p>\n<pre class=\"recuadroborde\">&lt;html&gt;\n\n&lt;head&gt;&lt;/head&gt;\n\n&lt;body&gt;\n  &lt;?php\n  echo \"Hola Mundo\";\n  ?&gt;\n&lt;/body&gt;\n\n&lt;/html&gt;\n</pre>\n<p>Es decir que la página que se generará al ejecutarse el programa será:</p>\n  \n<pre>\n&lt;html&gt;\n\n&lt;head&gt;&lt;/head&gt;\n\n&lt;body&gt;\n  Hola Mundo&lt;/body&gt;\n\n&lt;/html&gt;</pre><br>\n\n<p>Podemos utilizar como editor de texto para codificar el programa PHP el <strong>VS Code</strong>.</p>\n<p><strong>VS Code</strong>: Es un editor de texto que agregando extensiones podemos trabajar con PHP con herramientas para programar y depurar programas. Es creado y mantenido por la empresa Microsoft. Es open source y multiplataforma (Windows, Linux y Mac)<br>\n</p><p>En el último año se esta convirtiendo en el editor de texto más utilizado por los programadores profesionales de todo el mundo.<br>\n</p><p>Podemos comprobar esta situación si visitamos la encuesta de desarrolladores 2019 del sitio de \n<a href=\"https://insights.stackoverflow.com/survey/2019/#technology-_-most-popular-development-environments\" target=\"_blank\">stackoverflow</a></p>\n<p>Le sugiero si va ha utilizar el VS Code, luego se tome su tiempo para conocer en forma más profunda el editor VS Code mediante el tutorial <a href=\"https://www.tutorialesprogramacionya.com/herramientas/vscodeya/\" target=\"_blank\"> VS Code Ya</a></p>\n\n\n<p>Luego de tipear el programita con el editor de texto:</p>\n<img src=\"asset://assets/img/3_foto011.jpg\" border=\"0\" alt=\"Editor PHP VSCode\"><br>\n\n<p>Debemos almacenar dicho archivo en la subcarpeta 'htdocs' que depende de la carpeta 'xampp' (en mi caso instalé el XAMPP en c:/xampp)</p>\n<p>Lo almacenamos con el nombre pagina1.php en la carpeta C:/xampp/htdocs</p>\n<p>Este directorio es el que el servidor web Apache tiene asignado para recuperar páginas cuando se las solicitamos desde un navegador.</p>\n<p>Ya tenemos almacenado el archivo en la carpeta 'htdocs' del 'xampp', ahora procedemos a solicitar dicha página desde un navegador web, para esto en la barra del navegador escribimos: </p>\n<pre>http://localhost/pagina1.php\n</pre>\n<p><img src=\"asset://assets/img/3_foto012.jpg\" border=\"0\" alt=\"Navegador web\"></p>\n<p>Tenemos en el navegador el resultado de la ejecución del programa.</p>\n\n\n<p>Como podemos ver, es muy poco útil este programita, ya que el resultado de la ejecución de este programa PHP será siempre el mismo, es decir mostrar el texto \"Hola Mundo\".</p>\n\n<br>\n<br>\n\n<h2>Problema resuelto.</h2>\n<p>Copiar el contenido de este cuadro de texto al VS Code y almacenarlo en la carpeta c:/xampp/htdocs con un nombre con extensión php.<br>\n  luego abrir el navegador (Chrome, FireFox, IExplorer etc.) y en la barra de direcciones tipear:<br> http://localhost/pagina1.php (o el nombre del\narchivo que le dió)  </p>\n<pre>&lt;html&gt;\n\n&lt;head&gt;&lt;/head&gt;\n\n&lt;body&gt;\n  &lt;?php\n  echo \"Hola Mundo\";\n  echo \"&lt;br&gt;\";\n  echo \"como estas?\";\n  ?&gt;\n&lt;/body&gt;\n\n&lt;/html&gt;</pre>\n\n<h2>Problema propuesto.</h2>\n<p>Confeccione un programa que muestre una serie de mensajes en la página empleando el comando echo. Tenga en cuenta que cuando utiliza el comando echo el mensaje se debe encerrar entre comillas dobles (como veremos más adelante también podrá encerrarse entre simples comillas).<br>\nToda instrucción finaliza con punto y coma.</p>\n\n<p>Solución</p>\n<div id=\"recuadrooculto\">\npagina1.php<br>\n<pre>&lt;html&gt;\n\n&lt;head&gt;\n  &lt;title&gt;Problema&lt;/title&gt;\n&lt;/head&gt;\n\n&lt;body&gt;\n\n  &lt;?php\n  echo \"Mi nombre es Juan.\";\n  echo \"Tengo 20 años.\";\n  ?&gt;\n\n&lt;/body&gt;\n\n&lt;/html&gt;</pre>\n</div>"
}