{
  "id": "4",
  "title": "4 - Un programita mas util que \"Hola Mundo\"",
  "contenido": "<div>\n<h2>4 - Un programita más útil que \"Hola Mundo\"</h2>\n<p>Un problema sencillo que se nos puede presentar y que no se puede resolver empleando solo HTML es que una página esté disponible sólo los 10 primeros días del mes.</p>\n<p>Mostraremos un cartel que diga que el sitio se encuentra disponible si la fecha es menor o igual a 10, en caso contrario mostraremos un mensaje de sitio fuera de servicio.</p>\n\n<p>Para obtener la fecha del servidor web debemos llamar a la función date y requerir sólo el día:</p>\n<pre>\\$dia=date(\"d\");\n</pre>\n\n<p>A las variables en PHP se les antecede el caracter \\$. Si a la función date le pasamos el string \"d\" retornará sólo el día (si queremos la fecha completa: \\$fecha=date(\"d/m/Y\")</p>\n\n<p>Para verificar si la variable \\$dia es menor o igual a 10, debemos emplear la instrucción if, similar a otros lenguajes.</p>\n<p>Entonces la página con el programa queda de la siguiente forma:</p>\n<p class=\"titulopagina\">pagina1.php</p>\n<pre class=\"recuadroborde\">&lt;html&gt;\n\n&lt;head&gt;&lt;/head&gt;\n\n&lt;body&gt;\n  &lt;?php\n  \\$dia = date(\"d\");\n  if (\\$dia &lt;= 10) {\n    echo \"sitio activo\";\n  } else {\n    echo \"sitio fuera de servicio\";\n  }\n  ?&gt;\n&lt;/body&gt;\n\n&lt;/html&gt;\n</pre>\n\n<p>Los nombres de variables son sensibles a mayúsculas y minúsculas, por lo que si la escribimos en minúscula inicialmente debemos respetar en el resto del programa. En cambio las instrucciones del lenguaje PHP no son sensibles por lo que si deseamos escribir IF o if, las dos formas estarán bien (es más común escribir las palabras claves siempre en minúsculas)</p>\n<p>La condición del if debe ir obligatoriamente entre paréntesis. Los operadores relacionales disponibles son:</p>  \n<pre>&gt; Mayor\n&gt;= Mayor o igual\n&lt; Menor\n&lt;= Menor o igual\n== Igual\n!= Distinto\n</pre> \n<p>Si la condición se verifica verdadera se ejecuta el primer bloque encerrado entre llaves, en caso de verificarse falsa la condición se ejecuta el bloque entre llaves que le sigue al else.</p>\n\n<h2>Problema resuelto.</h2>\n<p>Copiar el contenido de este cuadro de texto al VS Code y almacenarlo en la carpeta c:/xampp/htdocs con un nombre con extensión php.<br>\n  luego abrir el navegador (Chrome, FireFox, IExplorer etc.) y en la barra de direcciones tipear:<br> http://localhost/pagina1.php (o el nombre del\narchivo que le dió)  </p>\n<pre>&lt;html&gt;\n\n&lt;head&gt;&lt;/head&gt;\n\n&lt;body&gt;\n\n  &lt;?php\n  \\$dia = date(\"d\");\n  if (\\$dia &lt;= 10) {\n    echo \"sitio activo\";\n  } else {\n    echo \"sitio fuera de servicio\";\n  }\n  ?&gt;\n\n&lt;/body&gt;\n\n&lt;/html&gt;</pre>\n<h2>Problema propuesto.</h2>\n<p>Sabiendo que la función rand nos retorna un valor aleatorio entre un rango de dos enteros:</p>\n<pre>\\$num=rand(1,100);\n</pre>\n<p>En la variable \\$num se almacena un valor entero que la computadora genera en forma aleatoria entre 1 y 100.</p>\n<p>Hacer un programa que lo muestre por pantalla al valor generado. Mostrar además si es menor o igual a 50 o si es mayor.</p>\n<p>Para imprimir el contenido de una variable también utilizamos el comando echo:</p>\n<pre>echo \\$num;\n</pre>\n<pre>&lt;html&gt;\n\n&lt;head&gt;\n  &lt;title&gt;Problema&lt;/title&gt;\n&lt;/head&gt;\n\n&lt;body&gt;\n\n  &lt;?php\n  \\$num = rand(1, 100);\n  echo \\$num;\n  echo \"&lt;br&gt;\";\n  if (\\$num &lt;= 50) {\n    echo \"El número es menor o igual a 50.\";\n  } else {\n    echo \"El número es mayor a 50.\";\n  }\n  ?&gt;\n\n&lt;/body&gt;\n\n&lt;/html&gt;</pre>\n</div>"
}